public class Main {
    public static void main(String[] args) {
        int price = 1000;
        int miles = price / 20;
        System.out.println(miles + "бонусных миль");

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}